## **Questions based on Titanic Dataset:**

To read the dataset as csv, use the below code:

```python
import pandas as pd

url = "https://docs.google.com/spreadsheets/d/e/2PACX-1vQjh5HzZ1N0SU7ME9ZQRzeVTaXaGsV97rU8R7eAcg53k27GTstJp9cRUOfr55go1GRRvTz1NwvyOnuh/pub?gid=1562145139&single=true&output=csv"
titanic_df = pd.read_csv(url)
```

In [3]:
# Libraries Import
import numpy as np
import pandas as pd
import warnings
import requests
from io import StringIO

In [4]:
def dataset(link):
    warnings.filterwarnings('ignore', message='Unverified HTTPS request')
    response = requests.get(link, verify=False)
    if response.status_code == 200:
        return StringIO(response.text)

In [5]:
titanic = pd.read_csv(dataset("https://docs.google.com/spreadsheets/d/e/2PACX-1vQjh5HzZ1N0SU7ME9ZQRzeVTaXaGsV97rU8R7eAcg53k27GTstJp9cRUOfr55go1GRRvTz1NwvyOnuh/pub?gid=1562145139&single=true&output=csv"))

In [19]:
titanic

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

### `Q-1:` Using `groupby` make groups using the `"Pclass"` column and find out the average age and total number of missing values in the `"Age"` column for every group.

In [61]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [50]:
# code here
titanic.groupby('Pclass')['Age'].mean()
titanic[titanic['Age'].isna()].groupby('Pclass').size()

Pclass
1     30
2     11
3    136
dtype: int64

### `Q-2:` Using `groupby` make groups using the `"Pclass"` column and fill every group's `"Embarked"` column's missing values with the mode value of that group. After that, print every group's `"Embarked"` column's value counts in ascending order.

In [77]:
# code here 
titanic['Embarked'] = titanic.groupby('Pclass', group_keys=False)['Embarked'].transform(lambda x: x.fillna(x.mode()[0]))

### `Q-3:` Make groups based on `"Embarked"` column. And for each of this embarked group, make another group based on `"Pclass"` and find out the average fare (round off up to 2 decimal places) for each "Pclass" for each group of "Embarked".

**Sample Output:**

```bash
{'C': {1: 105, 2: 25, 3: 11},
 'Q': {1: 90, 2: 12, 3: 11},
 'S': {1: 70, 2: 20, 3: 15}}
```

In [40]:
# code here
titanic.groupby(['Embarked','Pclass'])['Fare'].mean().round()

Embarked  Pclass
C         1         105.0
          2          25.0
          3          11.0
Q         1          90.0
          2          12.0
          3          11.0
S         1          70.0
          2          20.0
          3          15.0
Name: Fare, dtype: float64

## **Questions Based on Fifa Worldcup - 2022 Dataset:**

You can read the dataset by using the below sample code

```python
import pandas as pd

fifa_df = pd.read_csv("https://docs.google.com/spreadsheets/d/e/2PACX-1vT3D_x_4DS6d51LKJ7ze1sxT5WpV5uiSVOFYHLwBiGru6vFyVv5h5-83AwFjxWYiWfCDjDAaarHAV-k/pub?gid=0&single=true&output=csv")
```

In [54]:
fifa = pd.read_csv(dataset("https://docs.google.com/spreadsheets/d/e/2PACX-1vT3D_x_4DS6d51LKJ7ze1sxT5WpV5uiSVOFYHLwBiGru6vFyVv5h5-83AwFjxWYiWfCDjDAaarHAV-k/pub?gid=0&single=true&output=csv"))

In [55]:
fifa

,Sl. No,Match No.,Team,Against,Group,Goal,Possession (%),Inside Penalty Area,Outside Penalty Area,Assists,...,Fouls Against,Offsides,Passes,Passes Completed,Crosses,Crosses Completed,Corners,Free Kicks,Penalties Scored,Pts
0,1,1,Qatar,Ecuador,A,0,40,0,0,0,...,15,3,453,387,10,5,1,19,0,0
1,2,1,Ecuador,Qatar,A,2,46,2,0,1,...,15,4,484,419,26,10,3,17,1,3
2,3,2,England,Iran,B,6,69,6,0,6,...,9,2,810,733,29,9,8,16,0,3
3,4,2,Iran,England,B,2,20,2,0,1,...,14,2,232,156,11,3,0,10,1,0
4,5,3,Senegal,Netherlands,A,0,39,0,0,0,...,13,2,391,326,22,8,6,14,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
123,124,62,Morocco,Fram,F,0,55,0,0,0,...,11,3,583,518,22,1,3,15,0,0
124,125,63,Croatia,Morocco,F,2,45,2,0,2,...,13,2,491,430,21,3,6,13,0,3
125,126,63,Morocco,Croatia,F,1,45,1,0,0,...,11,2,494,428,20,5,3,15,0,0
126,127,64,Argentina,France,C,3,46,3,0,1,...,26,4,648,544,20,4,6,22,5,3
127,128,64,France,Argentina,D,3,40,3,0,1,...,19,4,516,419,24,3,5,28,4,0

### `Q-4:` Perform `groupby` based on the `"Team"` column and then perform Z Normalization on top of the below columns of each group:
1. Passes
2. Passes Completed
3. Attempted Line Breaks
4. Completed Line Breaks

You have to make a python function named `z_normalization` which takes two arguments:

1. *group:* Every group that you have created
2. *cols_to_perform:* This parameter takes a list of columns on which you have to perform the Z-Normalization.

For this problem, you have to use th `apply()` method.

$\Large Z \ - \ Normalization = \frac{X_i - \mu}{std} $

After that find out the below values for each group:
- minimum "Passess"
- maximum "Passess"
- minimum "Yellow Cards"
- maximum "Yellow cards"
- average "Yellow Cards"
- maximum "Attempted Line Breaks"
- minimum "Attempted Line Breaks"
- standardard deviation of "Attempted Line Breaks"
- average Possession

In [82]:
# code here
def z_normalization(group,column):
    return (group[column] - group[column].mean()) / group[column].std()
fifa.groupby('Team').apply(z_normalization, column = ['Passes','Passes Completed','Attempted Line Breaks','Completed Line Breaks'])

/var/folders/n2/xblt95t12h7cjhv3hf2dtsw00000gn/T/ipykernel_29213/1154547729.py:4: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  fifa.groupby('Team').apply(z_normalization, column = ['Passes','Passes Completed','Attempted Line Breaks','Completed Line Breaks'])

                 Passes  Passes Completed  Attempted Line Breaks  \
Team
Argentina 8   -0.208138         -0.157888               0.364745
          46  -0.630447         -0.574048              -0.795806
          77   1.685214          1.813757              -1.027917
          98   0.622403          0.592566               0.003684
          115 -0.137753         -0.253400               0.571065
...                 ...               ...                    ...
Uruguay   63  -0.931702         -0.894617              -0.484182
          89  -0.124867         -0.184945               1.149932
Wales     7   -0.054584         -0.139325               0.226294
          32   1.026174          1.062357               0.867461
          68  -0.971590         -0.923031              -1.093756

               Completed Line Breaks
Team
Argentina 8                 0.087403
          46               -0.945040
          77                0.049164
          98                0.393311
          115              -0.103791
...                              ...
Uruguay   63               -0.623480
          89                1.153437
Wales     7                 0.195342
          32                0.887916
          68               -1.083258

[128 rows x 4 columns]

In [86]:
# minimum "Passess"
fifa.groupby('Team')['Passes'].min()
# maximum "Passess"
fifa.groupby('Team')['Passes'].max()

Team
Argentina          862
Australia          466
Belgium            685
Brazil             695
Cameroon           500
Canada             536
Costa Rica         454
Croatia            724
Denmark            650
Ecuador            484
England            810
France             734
Germany            827
Ghana              460
Iran               463
Japan              591
Korea Republic     548
Mexico             500
Morocco            583
Netherlands        786
Poland             466
Portugal           678
Qatar              457
Saudi Arabia       560
Senegal            511
Serbia             513
Spain             1070
Switzerland        512
Tunisia            501
United States      572
Uruguay            528
Wales              508
Name: Passes, dtype: int64

In [88]:
# minimum "Yellow Cards"
fifa.groupby('Team')['Yellow Cards'].min()
# maximum "Yellow cards"
fifa.groupby('Team')['Yellow Cards'].max()
# average "Yellow Cards"
fifa.groupby('Team')['Yellow Cards'].mean()

Team
Argentina         2.285714
Australia         1.750000
Belgium           1.666667
Brazil            1.200000
Cameroon          2.666667
Canada            2.666667
Costa Rica        2.000000
Croatia           1.142857
Denmark           1.666667
Ecuador           1.000000
England           0.200000
France            1.142857
Germany           1.000000
Ghana             2.666667
Iran              2.333333
Japan             1.500000
Korea Republic    1.500000
Mexico            2.333333
Morocco           1.285714
Netherlands       1.800000
Poland            1.750000
Portugal          1.200000
Qatar             2.333333
Saudi Arabia      4.666667
Senegal           1.750000
Serbia            4.000000
Spain             0.500000
Switzerland       2.250000
Tunisia           1.666667
United States     1.250000
Uruguay           2.000000
Wales             1.666667
Name: Yellow Cards, dtype: float64

In [92]:
# maximum "Attempted Line Breaks"
fifa.groupby('Team')['Attempted Line Breaks'].max()
# minimum "Attempted Line Breaks"
fifa.groupby('Team')['Attempted Line Breaks'].min()
# standardard deviation of "Attempted Line Breaks"
fifa.groupby('Team')['Attempted Line Breaks'].std().round()

Team
Argentina         39.0
Australia         18.0
Belgium           14.0
Brazil            11.0
Cameroon          20.0
Canada            38.0
Costa Rica        39.0
Croatia           54.0
Denmark           34.0
Ecuador           17.0
England           30.0
France            21.0
Germany           57.0
Ghana             33.0
Iran              78.0
Japan             64.0
Korea Republic    27.0
Mexico            41.0
Morocco           11.0
Netherlands       13.0
Poland            36.0
Portugal          13.0
Qatar              8.0
Saudi Arabia      29.0
Senegal           17.0
Serbia            22.0
Spain             24.0
Switzerland        9.0
Tunisia           24.0
United States     28.0
Uruguay           22.0
Wales             53.0
Name: Attempted Line Breaks, dtype: float64

In [94]:
# average Possession
fifa.groupby('Team')['Possession (%)'].mean()

Team
Argentina         49.285714
Australia         31.250000
Belgium           49.000000
Brazil            50.400000
Cameroon          38.333333
Canada            44.333333
Costa Rica        27.333333
Croatia           47.428571
Denmark           51.333333
Ecuador           42.666667
England           57.200000
France            44.857143
Germany           53.000000
Ghana             37.000000
Iran              31.666667
Japan             30.250000
Korea Republic    42.250000
Mexico            46.666667
Morocco           34.285714
Netherlands       44.000000
Poland            32.000000
Portugal          53.800000
Qatar             39.333333
Saudi Arabia      36.666667
Senegal           38.500000
Serbia            42.666667
Spain             67.000000
Switzerland       43.000000
Tunisia           38.666667
United States     47.000000
Uruguay           41.000000
Wales             41.000000
Name: Possession (%), dtype: float64

## **Questions on IPL wala dataset**

ball by ball dataset - https://drive.google.com/file/d/1-kvv_9KCSAFWcrhS9WgTxSrURkRh6GNt/view?usp=share_link

In [96]:
ipl = pd.read_csv(dataset("https://drive.google.com/uc?export=download&id=1-kvv_9KCSAFWcrhS9WgTxSrURkRh6GNt"))
ipl

,ID,Team,innings,overs,ballnumber,batter,bowler,non-striker,extra_type,batsman_run,extras_run,total_run,non_boundary,isWicketDelivery,player_out,kind,fielders_involved,BattingTeam,BowlingTeam
0,1312200,Rajasthan RoyalsGujarat Titans,1,0,1,YBK Jaiswal,Mohammed Shami,JC Buttler,NaN,0,0,0,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
1,1312200,Rajasthan RoyalsGujarat Titans,1,0,2,YBK Jaiswal,Mohammed Shami,JC Buttler,legbyes,0,1,1,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
2,1312200,Rajasthan RoyalsGujarat Titans,1,0,3,JC Buttler,Mohammed Shami,YBK Jaiswal,NaN,1,0,1,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
3,1312200,Rajasthan RoyalsGujarat Titans,1,0,4,YBK Jaiswal,Mohammed Shami,JC Buttler,NaN,0,0,0,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
4,1312200,Rajasthan RoyalsGujarat Titans,1,0,5,YBK Jaiswal,Mohammed Shami,JC Buttler,NaN,0,0,0,0,0,NaN,NaN,NaN,Rajasthan Royals,Gujarat Titans
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
225949,335982,Royal Challengers BangaloreKolkata Knight Riders,2,14,5,P Kumar,I Sharma,SB Joshi,legbyes,0,1,1,0,0,NaN,NaN,NaN,Royal Challengers Bangalore,Kolkata Knight Riders
225950,335982,Royal Challengers BangaloreKolkata Knight Riders,2,14,6,SB Joshi,I Sharma,P Kumar,NaN,1,0,1,0,0,NaN,NaN,NaN,Royal Challengers Bangalore,Kolkata Knight Riders
225951,335982,Royal Challengers BangaloreKolkata Knight Riders,2,14,7,P Kumar,I Sharma,SB Joshi,NaN,0,0,0,0,0,NaN,NaN,NaN,Royal Challengers Bangalore,Kolkata Knight Riders
225952,335982,Royal Challengers BangaloreKolkata Knight Riders,2,15,1,SB Joshi,LR Shukla,P Kumar,wides,0,1,1,0,0,NaN,NaN,NaN,Royal Challengers Bangalore,Kolkata Knight Riders
225953,335982,Royal Challengers BangaloreKolkata Knight Riders,2,15,2,SB Joshi,LR Shukla,P Kumar,NaN,0,0,0,0,1,SB Joshi,caught,BB McCullum,Royal Challengers Bangalore,Kolkata Knight Riders

### `Q-5:` Find batsman in below category-
* Highest score while chasing
* Best Strike rate while chasing and have faced 100+ balls


> Chasing mean team batting in second inning

In [110]:
# code here
ipl[ipl['innings']==2].groupby(['ID','batter'])['batsman_run'].sum().sort_values(ascending = False).reset_index().loc[0]

ID                  501206
batter         PC Valthaty
batsman_run            120
Name: 0, dtype: object

In [144]:
# Best Strike rate while chasing and have faced 100+ balls
temp_ipl = ipl[~(ipl['extra_type'] == 'wides')].groupby('batter').agg({
    'batsman_run': 'sum',
    'ballnumber':'count'
})
temp_ipl['strike_rate'] = temp_ipl['batsman_run']/temp_ipl['ballnumber'] *100
temp_ipl[temp_ipl['ballnumber'] >= 100].sort_values('strike_rate',ascending = False)

                batsman_run  ballnumber  strike_rate
batter
AD Russell             2039        1147   177.768091
BCJ Cutting             238         141   168.794326
K Gowtham               186         111   167.567568
LS Livingstone          549         329   166.869301
JM Sharma               234         143   163.636364
...                     ...         ...          ...
Mohammed Siraj           96         109    88.073394
CJ Ferguson              98         117    83.760684
Z Khan                  117         141    82.978723
Kuldeep Yadav           105         127    82.677165
RT Ponting               91         128    71.093750

[261 rows x 3 columns]

### `Q-6` Most Successful bowler against any batsman. Find that pair of bowler and batsman.
> Most Successful in terms of dissmissal. A bowler who have dissmissed any batsman most no of times. If any two pairs have same no of dissmisal, consider runs conceded by bowler to that batsman. Those who have concede lesser runs is more successful.

In [128]:
# code here
ipl[~ipl['player_out'].isna()].groupby(['batter','bowler'])['player_out'].count().sort_values(ascending = False).reset_index().loc[0]

batter        RG Sharma
bowler        SP Narine
player_out            8
Name: 0, dtype: object

### `Q-7`: Most successful batting pair in IPL. Batting pair who have scored most runs playing together.

In [133]:
# code here
ipl.groupby(['batter','non-striker'])['batsman_run'].sum().sort_values(ascending = False).reset_index().loc[0]

batter         AB de Villiers
non-striker           V Kohli
batsman_run              1566
Name: 0, dtype: object

### `Q-8:` Make a dataframe for all batting pairs played together.
```
Batsman1 Batsman2 Runs Avg StrikeRate
```

> Just to ease this question you can count wide-balls for strike rate.

In [ ]:
# code here